In [6]:
import pandas as pd
import sqlite3

In [2]:
import os

In [3]:
%pwd

u'/Users/Driz/data_sci_wk3'

In [22]:
conn = sqlite3.connect('../DSI-CHI-1/lessons/week-05/1.3-db-lab/assets/datasets/enron.db')
c = conn.cursor()

NameError: name 'results' is not defined

In [13]:
results_employee = c.execute('SELECT * FROM EmployeeBase LIMIT 5;')
results_employee.fetchall()

[(1,
  u'John Arnold',
  u'Forestry',
  u'ENA Gas Financial',
  u'VP Trading',
  u'Male',
  u'Senior'),
 (2,
  u'Harry Arora',
  u'Forestry',
  u'ENA East Power',
  u'VP Trading',
  u'Male',
  u'Senior'),
 (3,
  u'Robert Badeer',
  u'Forestry',
  u'ENA West Power',
  u'Mgr Trading',
  u'Male',
  u'Junior'),
 (4,
  u'Susan Bailey',
  u'Legal',
  u'ENA Legal',
  u'Specialist Legal',
  u'Female',
  u'Junior'),
 (5,
  u'Eric Bass',
  u'Forestry',
  u'ENA Gas Texas',
  u'Trader',
  u'Male',
  u'Junior')]

In [19]:
results_message = c.execute('SELECT * FROM MessageBase LIMIT 5;')
results_message.fetchall()

[(1, u'taylor-m/sent/11', 910930020, u'Cd$ CME letter', 138),
 (2, u'taylor-m/sent/17', 911459940, u'Indemnification', 138),
 (3, u'taylor-m/sent/18', 911463840, u'Re: Indemnification', 138),
 (4, u'taylor-m/sent/23', 911874180, u'Re: Coral Energy, L.P.', 138),
 (5, u'taylor-m/sent/27', 912396120, u'Bankruptcy Code revisions', 138)]

In [20]:
recipient_message = c.execute('SELECT * FROM RecipientBase LIMIT 5;')
recipient_message.fetchall()

[(1, 1, 59), (2, 1, 15), (3, 1, 15), (4, 1, 109), (4, 2, 49)]

In [24]:
employees = pd.read_sql('SELECT * FROM EmployeeBase;', con=conn)
employees.head()

,eid,name,department,longdepartment,title,gender,seniority
0,1,John Arnold,Forestry,ENA Gas Financial,VP Trading,Male,Senior
1,2,Harry Arora,Forestry,ENA East Power,VP Trading,Male,Senior
2,3,Robert Badeer,Forestry,ENA West Power,Mgr Trading,Male,Junior
3,4,Susan Bailey,Legal,ENA Legal,Specialist Legal,Female,Junior
4,5,Eric Bass,Forestry,ENA Gas Texas,Trader,Male,Junior

In [25]:
messages = pd.read_sql('SELECT * FROM MessageBase;', con=conn)
messages.head()

   mid          filename  unix_time                    subject  from_eid
0    1  taylor-m/sent/11  910930020             Cd$ CME letter       138
1    2  taylor-m/sent/17  911459940            Indemnification       138
2    3  taylor-m/sent/18  911463840        Re: Indemnification       138
3    4  taylor-m/sent/23  911874180     Re: Coral Energy, L.P.       138
4    5  taylor-m/sent/27  912396120  Bankruptcy Code revisions       138

In [26]:
recipient = pd.read_sql('SELECT * FROM RecipientBase;', con=conn)
recipient.head()

   mid  rno  to_eid
0    1    1      59
1    2    1      15
2    3    1      15
3    4    1     109
4    4    2      49

In [27]:
employees.shape

(156, 7)

In [28]:
employees.count()

eid               156
name              156
department        156
longdepartment    156
title             156
gender            156
seniority         156
dtype: int64

In [29]:
messages.count()

mid          21635
filename     21635
unix_time    21635
subject      21635
from_eid     21635
dtype: int64

In [37]:
messages['datetime'] = pd.to_datetime(messages['unix_time'], unit ='s')

In [39]:
messages.head()

,mid,filename,unix_time,subject,from_eid,datetime
0,1,taylor-m/sent/11,1998-11-13 04:07:00,Cd$ CME letter,138,1998-11-13 04:07:00
1,2,taylor-m/sent/17,1998-11-19 07:19:00,Indemnification,138,1998-11-19 07:19:00
2,3,taylor-m/sent/18,1998-11-19 08:24:00,Re: Indemnification,138,1998-11-19 08:24:00
3,4,taylor-m/sent/23,1998-11-24 02:23:00,"Re: Coral Energy, L.P.",138,1998-11-24 02:23:00
4,5,taylor-m/sent/27,1998-11-30 03:22:00,Bankruptcy Code revisions,138,1998-11-30 03:22:00

In [41]:
messages['datetime'].describe()

count                   21635
unique                  21309
top       1999-12-27 03:21:00
freq                        4
first     1998-11-13 04:07:00
last      2002-06-21 13:37:34
Name: datetime, dtype: object

In [42]:
messages['datetime'].max(), messages['datetime'].min()

(Timestamp('2002-06-21 13:37:34'), Timestamp('1998-11-13 04:07:00'))

In [43]:
recipient['mid'].value_counts()

12116    57
12151    57
12140    55
14404    52
16035    49
16431    24
8116     22
15577    21
15148    21
21103    20
21047    19
19671    18
10087    17
6495     17
19028    16
21628    16
12584    16
14194    16
18305    16
11492    16
14547    16
11516    16
14457    16
15584    15
13770    15
15121    15
15219    15
8970     15
15116    15
1355     15
         ..
2930      1
17243     1
21337     1
9047      1
11094     1
13141     1
15188     1
2898      1
4945      1
6992      1
17211     1
19258     1
21305     1
11062     1
17147     1
13109     1
15156     1
2866      1
4913      1
17179     1
19226     1
21273     1
11030     1
13077     1
15124     1
787       1
2834      1
4881      1
6928      1
2049      1
Name: mid, dtype: int64

In [45]:
import numpy as np

In [51]:
pivot_table = recipient.pivot_table(index='mid', values='rno', aggfunc=np.max)

In [52]:
pivot_table.value_counts()

1     14985
2      2962
3      1435
4       873
5       711
6       180
7       176
8        61
13       57
11       47
12       33
10       29
15       28
9        24
14       11
16        9
21        2
17        2
57        2
22        1
52        1
20        1
55        1
19        1
24        1
18        1
49        1
Name: rno, dtype: int64

In [54]:
# same as above
recipient.pivot_table(index='mid', values='to_eid', aggfunc=len).value_counts()

1     14985
2      2962
3      1435
4       873
5       711
6       180
7       176
8        61
13       57
11       47
12       33
10       29
15       28
9        24
14       11
16        9
21        2
17        2
57        2
22        1
52        1
20        1
55        1
19        1
24        1
18        1
49        1
Name: to_eid, dtype: int64